# SharedParameterApplicableRule Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SharedParameterApplicableRule Class
Members See Also
---
Tests whether an element supports a shared parameter.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public class SharedParameterApplicableRule : FilterRule
```

Visual Basic
---
```text
Public Class SharedParameterApplicableRule _
	Inherits FilterRule
```

Visual C++
---
```text
public ref class SharedParameterApplicableRule : public FilterRule
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..FilterRule Autodesk.Revit.DB..::..SharedParameterApplicableRule
# See Also
SharedParameterApplicableRule Members
Autodesk.Revit.DB Namespace